micropython/micropython/ports/mimxrt/machine_spi.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2020-2021 Damien P. George
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "py/runtime.h"
#include "py/mphal.h"
#include "py/mperrno.h"
#include "extmod/machine_spi.h"
#include "modmachine.h"

#include "fsl_common.h"
#include "fsl_lpspi.h"
#include "fsl_iomuxc.h"

#define DEFAULT_SPI_BAUDRATE    (1000000)
#define DEFAULT_SPI_POLARITY    (0)
#define DEFAULT_SPI_PHASE       (0)
#define DEFAULT_SPI_BITS        (8)
#define DEFAULT_SPI_FIRSTBIT    (kLPSPI_MsbFirst)

#define CLOCK_DIVIDER           (3)

typedef struct _machine_spi_obj_t {
    mp_obj_base_t base;
    uint8_t spi_id;
    LPSPI_Type *spi_inst;
    lpspi_master_config_t config;
    lpspi_master_handle_t handle;
} machine_spi_obj_t;

STATIC const uint8_t spi_index_table[] = MICROPY_HW_SPI_INDEX;
STATIC LPSPI_Type *spi_base_ptr_table[] = LPSPI_BASE_PTRS;
extern bool lpspi_set_iomux(int8_t spi);

static const char *firstbit_str[] = {"MSB", "LSB"};


STATIC void machine_spi_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_spi_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print, "SPI(%u, baudrate=%u, polarity=%u, phase=%u, bits=%u, firstbit=%s)",
        self->spi_id, self->config.baudRate, self->config.cpol, self->config.cpha, self->config.bitsPerFrame,
        firstbit_str[self->config.direction]);
}

mp_obj_t machine_spi_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {
    enum { ARG_id, ARG_baudrate, ARG_polarity, ARG_phase, ARG_bits, ARG_firstbit, ARG_gap };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_id,       MP_ARG_REQUIRED | MP_ARG_OBJ },
        { MP_QSTR_baudrate, MP_ARG_INT, {.u_int = DEFAULT_SPI_BAUDRATE} },
        { MP_QSTR_polarity, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = DEFAULT_SPI_POLARITY} },
        { MP_QSTR_phase,    MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = DEFAULT_SPI_PHASE} },
        { MP_QSTR_bits,     MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = DEFAULT_SPI_BITS} },
        { MP_QSTR_firstbit, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = DEFAULT_SPI_FIRSTBIT} },
        { MP_QSTR_gap,      MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
    };

    static bool clk_init = true;

    // Parse the arguments.
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // Get the SPI bus id.
    int spi_id = mp_obj_get_int(args[ARG_id].u_obj);
    if (spi_id < 0 || spi_id >= MP_ARRAY_SIZE(spi_index_table)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) doesn't exist"), spi_id);
    }

    // Get peripheral object.
    uint8_t spi_hw_id = spi_index_table[spi_id];  // the hw spi number 1..n
    machine_spi_obj_t *self = m_new_obj(machine_spi_obj_t);
    self->base.type = &machine_spi_type;
    self->spi_id = spi_id;
    self->spi_inst = spi_base_ptr_table[spi_hw_id];
    LPSPI_MasterGetDefaultConfig(&self->config);

    if (clk_init) {
        clk_init = false;
        /*Set clock source for LPSPI*/
        CLOCK_SetMux(kCLOCK_LpspiMux, 1);  // Clock source is kCLOCK_Usb1PllPfd0Clk
        CLOCK_SetDiv(kCLOCK_LpspiDiv, CLOCK_DIVIDER);
    }

    // Initialise the SPI peripheral.
    self->config.baudRate = args[ARG_baudrate].u_int;
    self->config.betweenTransferDelayInNanoSec = 1000000000 / self->config.baudRate * 2;
    self->config.cpol = args[ARG_polarity].u_int;
    self->config.cpha = args[ARG_phase].u_int;
    self->config.bitsPerFrame = args[ARG_bits].u_int;
    self->config.direction = args[ARG_firstbit].u_int;
    if (args[ARG_gap].u_int != -1) {
        self->config.betweenTransferDelayInNanoSec = args[ARG_gap].u_int;
    }

    lpspi_set_iomux(spi_index_table[spi_id]);
    LPSPI_Enable(self->spi_inst, false);  // Disable first before new settings are applies
    LPSPI_MasterInit(self->spi_inst, &self->config, CLOCK_GetFreq(kCLOCK_Usb1PllPfd0Clk) / (CLOCK_DIVIDER + 1));

    return MP_OBJ_FROM_PTR(self);
}

STATIC void machine_spi_init(mp_obj_base_t *self_in, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_baudrate, ARG_polarity, ARG_phase, ARG_bits, ARG_firstbit, ARG_gap };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_baudrate, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_polarity, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_phase,    MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_bits,     MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_firstbit, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_gap,      MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
    };

    // Parse the arguments.
    machine_spi_obj_t *self = (machine_spi_obj_t *)self_in;
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);
    bool set_format = false;

    // Reconfigure the baudrate if requested.
    if (args[ARG_baudrate].u_int != -1) {
        self->config.baudRate = args[ARG_baudrate].u_int;
        self->config.betweenTransferDelayInNanoSec = 1000000000 / self->config.baudRate * 2;
        set_format = true;
    }

    // Reconfigure the format if requested.
    if (args[ARG_polarity].u_int != -1) {
        self->config.cpol = args[ARG_polarity].u_int;
        set_format = true;
    }
    if (args[ARG_phase].u_int != -1) {
        self->config.cpha = args[ARG_phase].u_int;
        set_format = true;
    }
    if (args[ARG_bits].u_int != -1) {
        self->config.bitsPerFrame = args[ARG_bits].u_int;
        set_format = true;
    }
    if (args[ARG_firstbit].u_int != -1) {
        self->config.direction = args[ARG_firstbit].u_int;
    }
    if (args[ARG_gap].u_int != -1) {
        self->config.betweenTransferDelayInNanoSec = args[ARG_gap].u_int;
    }
    if (set_format) {
        LPSPI_Enable(self->spi_inst, false);  // Disable first before new settings are applies
        LPSPI_MasterInit(self->spi_inst, &self->config, CLOCK_GetFreq(kCLOCK_Usb1PllPfd0Clk) / (CLOCK_DIVIDER + 1));
    }
}

STATIC void machine_spi_transfer(mp_obj_base_t *self_in, size_t len, const uint8_t *src, uint8_t *dest) {
    machine_spi_obj_t *self = (machine_spi_obj_t *)self_in;
    // Use DMA for large transfers if channels are available
    // const size_t dma_min_size_threshold = 32;
    // int chan_tx = -1;
    // int chan_rx = -1;
    // // if (len >= dma_min_size_threshold) {
    //     // Use two DMA channels to service the two FIFOs
    //     chan_tx = dma_claim_unused_channel(false);
    //     chan_rx = dma_claim_unused_channel(false);
    // }
    bool use_dma = false; // chan_rx >= 0 && chan_tx >= 0;
    // note src is guaranteed to be non-NULL
    // bool write_only = dest == NULL;

    // if (use_dma) {
    //     uint8_t dev_null;
    //     dma_channel_config c = dma_channel_get_default_config(chan_tx);
    //     channel_config_set_transfer_data_size(&c, DMA_SIZE_8);
    //     channel_config_set_dreq(&c, spi_get_index(self->spi_inst) ? DREQ_SPI1_TX : DREQ_SPI0_TX);
    //     dma_channel_configure(chan_tx, &c,
    //         &spi_get_hw(self->spi_inst)->dr,
    //         src,
    //         len,
    //         false);

    //     c = dma_channel_get_default_config(chan_rx);
    //     channel_config_set_transfer_data_size(&c, DMA_SIZE_8);
    //     channel_config_set_dreq(&c, spi_get_index(self->spi_inst) ? DREQ_SPI1_RX : DREQ_SPI0_RX);
    //     channel_config_set_read_increment(&c, false);
    //     channel_config_set_write_increment(&c, !write_only);
    //     dma_channel_configure(chan_rx, &c,
    //         write_only ? &dev_null : dest,
    //         &spi_get_hw(self->spi_inst)->dr,
    //         len,
    //         false);

    //     dma_start_channel_mask((1u << chan_rx) | (1u << chan_tx));
    //     dma_channel_wait_for_finish_blocking(chan_rx);
    //     dma_channel_wait_for_finish_blocking(chan_tx);
    // }

    // // If we have claimed only one channel successfully, we should release immediately
    // if (chan_rx >= 0) {
    //     dma_channel_unclaim(chan_rx);
    // }
    // if (chan_tx >= 0) {
    //     dma_channel_unclaim(chan_tx);
    // }

    if (!use_dma) {
        // Use software for small transfers, or if couldn't claim two DMA channels
        lpspi_transfer_t masterXfer;

        masterXfer.txData = (uint8_t *)src;
        masterXfer.rxData = (uint8_t *)dest;
        masterXfer.dataSize = len;
        masterXfer.configFlags =
           kLPSPI_MasterPcs0 | kLPSPI_MasterPcsContinuous | kLPSPI_MasterByteSwap;

        LPSPI_MasterTransferBlocking(self->spi_inst, &masterXfer);
    }
}

STATIC const mp_machine_spi_p_t machine_spi_p = {
    .init = machine_spi_init,
    .transfer = machine_spi_transfer,
};

const mp_obj_type_t machine_spi_type = {
    { &mp_type_type },
    .name = MP_QSTR_SPI,
    .print = machine_spi_print,
    .make_new = machine_spi_make_new,
    .protocol = &machine_spi_p,
    .locals_dict = (mp_obj_dict_t *)&mp_machine_spi_locals_dict,
};
